cf_billing/Enums/энргСпособыОпределенияСоциальнойНормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСпособыОпределенияСоциальнойНормы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СоциальнаяНормаРавнаНормативуПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Использовать</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/Enums/энргСпособыОпределенияСоциальнойНормы/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.энргСпособыОпределенияСоциальнойНормы.ПустаяСсылка(),"Не использовать");
	ДанныеВыбора.Добавить(Перечисления.энргСпособыОпределенияСоциальнойНормы.СоциальнаяНормаРавнаНормативуПотребления,"Социальная норма равна нормативу потребления");
	ДанныеВыбора.Добавить(Перечисления.энргСпособыОпределенияСоциальнойНормы.Использовать,"Использовать, согласно настройкам");	
КонецПроцедуры
